:PROPERTIES:
:ID:       87215d26-a10c-4eca-b6e4-dbdcbb90dbee
:END:
#+title: Reading List

A list of books and articles that I'd like to read at some point.

* [ ] Maybe move this reading list into the Books note in my org files, and rename that one to "Reading List"? I don't know if there's a benefit to this being an org-roam node.

* Articles
** [1/1] Software planning
*** NO [[https://basecamp.com/shapeup][Shape Up]]
- Note taken on [2024-08-30 Fri 10:34] \\
  Will want to read eventually, but we are moving away from this approach at work, so no point in prioritizing it.
** [0/1] Architecture
*** [-] [[https://martinfowler.com/eaaDev/EventSourcing.html][Event Sourcing]] by Martin Fowler
** [0/1] C#
*** [ ] [[https://andrewlock.net/series/behind-the-scenes-of-minimal-apis/][Behind the scenes of Minimal APIs]]
** [/] Wezterm
*** [ ] [[https://www.florianbellmann.com/blog/switch-from-tmux-to-wezterm][How to switch from Tmux to WezTerm]]

* Books
** Life
*** [1/2] Habits
**** HOLD Atomic Habits
- Note taken on [2024-08-15 Thu 08:07] \\
  Read the intro. Will pick it up again after finishing The Power of Habit.
**** [X] The Power of Habit
** Philosophy
*** [0/2] Stoicism
**** [-] Letters from a Stoic
**** HOLD Meditations
- Note taken on [2024-08-15 Thu 08:05] \\
  Holding off on this one until I finish Letters from a Stoic.
** Programming
*** [[id:1c0131b0-54d9-4b00-9214-3920c53984d2][F#]]
**** [8/16] [[id:b62df05a-56ae-416a-932f-868114759457][F# In Action]]
***** [X] Chapter 1
***** [X] Chapter 2
:LOGBOOK:
CLOCK: [2024-08-30 Fri 17:00]--[2024-08-30 Fri 17:46] =>  0:46
:END:
***** [X] Chapter 3
***** [X] Chapter 4
***** [X] Chapter 5
:LOGBOOK:
CLOCK: [2024-09-06 Fri 08:44]--[2024-09-06 Fri 09:48] =>  1:04
CLOCK: [2024-09-05 Thu 18:05]--[2024-09-05 Thu 18:40] =>  0:35
:END:
***** [X] Chapter 6
:LOGBOOK:
CLOCK: [2024-09-09 Mon 08:04]--[2024-09-09 Mon 08:05] =>  0:01
:END:
***** [X] Chapter 7
:LOGBOOK:
CLOCK: [2024-09-24 Tue 08:35]--[2024-09-24 Tue 08:53] =>  0:18
CLOCK: [2024-09-17 Tue 17:15]--[2024-09-17 Tue 17:20] =>  0:05
CLOCK: [2024-09-13 Fri 09:38]--[2024-09-13 Fri 09:44] =>  0:06
CLOCK: [2024-09-13 Fri 09:10]--[2024-09-13 Fri 09:38] =>  0:28
CLOCK: [2024-09-13 Fri 08:48]--[2024-09-13 Fri 09:05] =>  0:17
:END:
***** [X] Chapter 8
- Note taken on [2024-09-27 Fri 22:04] \\
  Left off at section 8.3, Discriminated Unions.

  I think I'm going to need my full brain power to read this one. I'm way too tired right now.
:LOGBOOK:
CLOCK: [2024-10-03 Thu 23:10]--[2024-10-03 Thu 23:32] =>  0:22
CLOCK: [2024-09-27 Fri 21:20]--[2024-09-27 Fri 22:04] =>  0:44
CLOCK: [2024-09-17 Tue 17:35]--[2024-09-17 Tue 17:44] =>  0:09
:END:
***** [ ] Chapter 9
***** [ ] Chapter 10
***** [ ] Chapter 11
***** [ ] Chapter 12
***** [ ] Chapter 13
***** [ ] Chapter 14
***** [ ] Chapter 15
***** [ ] Chapter 16

*** [0/1] General
**** [-] [[id:42a0e03e-ed8b-4922-96c0-d60ffed1f7b1][Working Effectively with Legacy Code]]
DEADLINE: <2024-09-30 Mon>
:LOGBOOK:
CLOCK: [2024-08-30 Fri 11:28]--[2024-08-30 Fri 11:53] =>  0:25
CLOCK: [2024-08-30 Fri 10:54]--[2024-08-30 Fri 11:19] =>  0:25
CLOCK: [2024-08-26 Mon 21:26]--[2024-08-26 Mon 21:51] =>  0:25
CLOCK: [2024-08-26 Mon 09:16]--[2024-08-26 Mon 09:41] =>  0:25
CLOCK: [2024-08-26 Mon 08:41]--[2024-08-26 Mon 09:06] =>  0:25
:END:
*** [0/1] HTMX
**** [ ] [[https://hypermedia.systems/][Hypermedia Systems]]
*** [0/3] Interview Prep
**** [ ] Cracking the Coding Interview
**** [ ] System Design Interview, Volume 1
**** [ ] System Design Interview, Volume 2
*** [0/1] PostgreSQL
**** [-] 100 PostgreSQL Mistakes and how to avoid them
*** [1/2] React
**** [X] [[https://livebook.manning.com/book/react-quickly-second-edition][React Quickly]]
- Note taken on [2024-08-15 Thu 07:47] \\
  Marking this one done for now. There are still two more exercise chapters left (chapters 12 & 13).

  Maybe I'll come back and do them later. Maybe not.

  Honestly, I can't stand to work with [[id:bb077623-5540-4767-b6d9-ae4301af5ef2][React]] any longer than I have to.

**** [ ] [[id:16ea837b-410d-4e87-9eea-90033c2e013b][React In Depth]]
***** [X] Chapter 1
***** [ ] Chapter 2
***** [ ] Chapter 3
***** [ ] Chapter 4
***** [ ] Chapter 5
***** [ ] Chapter 6
***** [ ] Chapter 7
***** [ ] Chapter 8
***** [ ] Chapter 9
***** [ ] Chapter 10
***** [ ] Chapter 11
***** [ ] Chapter 12
***** [ ] Chapter 13
***** [ ] Chapter 14
